import random
print("Здравствуйте")
print("Вам нужно угодать слово по буквам")
user_letters=[]
tries=10
secret_words=["носорог","крокодил","фламинго","тюлень","крыса","собака","росомаха","шимпанзе","обезьяна","немо","яблоко", "банан", "груша", "апельсин", "лимон", "киви", "ананас", "манго", "грейпфрут", "персик", "слива", "вишня", "арбуз", "артишок", "баклажан", "брокколи", "морковь", "помидор", "кабачок", "огурец", "перец", "картофель", "лук", "чеснок", "капуста", "шпинат", "редис", "сельдерей", "свекла",  "горох", "фасоль", "грибы", "клубника", "виноград", "малина", "ежевика", "голубика", "черника", "клюква", "мандарин", "гранат", "крыжовник","стул", "стол", "диван", "кровать", "шкаф", "комод", "полка", "телевизор", "холодильник", "плита", "духовка", "чайник", "кофеварка", "тостер", "миксер", "утюг", "пылесос", "фен", "лампа", "подсвечник", "зеркало", "картина", "ковер", "шторы", "подушка", "простынь", "одеяло", "полотенце",]
secret_word=random.choice(secret_words)

while True:
    win=True
    print("Кол-во попыток "+str(tries))
    tries-=1
    user_letter=input("Ваша буква ")
    user_letters.append(user_letter)
    if user_letter in secret_word:
        print("Вы отгадали букву,поздравляю")
    else:
        print("К сожелению ваша буква не присутствует в слове")
    for secret_letter in secret_word:
        if secret_letter in user_letters:
            print(secret_letter)
        else:
            print("*")
            win=False
    if win==True:
        print("ВЫ выиграли")
        break
            
    if tries==0:
        print("Вы проиграли")
        print(secret_word)
        break
    
